RIET/src/InformationRegisters/ЖурналОтчетовСтатусы/ЖурналОтчетовСтатусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтчетовСтатусы</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтролирующегоОргана</name>
    <type>
      <types>EnumRef.ТипыКонтролирующихОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтчета</name>
    <comment>Корректировочный номер (0 - Первичный).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйПериод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостояниеСдачиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправляетсяВКонтролирующийОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибкиОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/СтраницыЖурналаОтчетность/СтраницыЖурналаОтчетность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтраницыЖурналаОтчетность</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Отчеты</name>
  </enumValues>
  <enumValues>
    <name>Уведомления</name>
  </enumValues>
  <enumValues>
    <name>Письма</name>
  </enumValues>
  <enumValues>
    <name>Сверки</name>
  </enumValues>
  <enumValues>
    <name>ЕГРЮЛ</name>
  </enumValues>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Настройки</name>
  </enumValues>
</mdclass:Enum>

RIET/src/InformationRegisters/ЖурналОтчетовСтатусы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		Запись = Новый Структура;
		Запись.Вставить("Объект", ЗаписьРегистра.Ссылка);
		Запись.Вставить("Организация", ЗаписьРегистра.Организация);
		Запись.Вставить("Страница", Перечисления.СтраницыЖурналаОтчетность.Отчеты);
		Запись.Вставить("КонтролирующийОрган", ЗаписьРегистра.ПредставлениеКонтролирующегоОргана);
		Запись.Вставить("Состояние", ЗаписьРегистра.СостояниеСдачиОтчетности);
		Запись.Вставить("Статус", ЗаписьРегистра.Статус);
		Запись.Вставить("Наименование", ЗаписьРегистра.НаименованиеОтчета);
		Запись.Вставить("НеОтправляетсяВКонтролирующийОрган", ЗаписьРегистра.НеОтправляетсяВКонтролирующийОрган);
		Запись.Вставить("ЕстьОтвет", Ложь);
		Запись.Вставить("ВидКонтролирующегоОргана", ЗаписьРегистра.ВидКонтролирующегоОргана);
		
		//Обновление рег. Отчетности на бух. Корп 3.0.36.18
		//ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаписатьСобытиеДокументооборотаСКО(Запись);
		//<=
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
